from get_up_data_handler import Message
from get_up_data_handler import ChainMessageReminderService
from get_up_data_handler import pretty_json_print_dict


"""
Unit Tests
"""


if __name__ == '__main__':
    test_msg_content = "wxid_6rfqzef7hjir22:\n#接龙\n早上好呀，早起有哪些清醒步骤\n\n1. 大*-** 4:30\n-5:30阅读&筋**松\n-7:00跑***\n-8:00洗漱***路\n-9:00阅读\n2. M*** 4:52\n-5:10 小**\n-5:30 冥想🧘\u200d♀️\n-6:00-《也许你该找个人聊聊》\n-6:45有氧\n-7:20收拾洗漱出门\n3. 李*** 5:33\n6:10 护肤，听课\n6:30 冥想🧘\u200d♀️，《心经》，自我肯定\n6:58 背书，蒙田的教育思想\n7:20 出门\n4. 和**** 6-9.24\n-7.51 清理 13 个随手记正念\n-9.24 今天的依赖倒置原则终于非常快速懂了，设计原则和模式就像摄影的构图和拍人脚放在下面一样\n心智觉察解悟，原来评判也是一种情绪，评判由于有了对与错，但是实际上没有对错好坏，放下对错，对错是你五官收集起来的\n5. 利**** 6:10\n6. 人***** 6:18\n-6:40坐在床上清醒，最近总是睡得晚，起不来了\n-7:20听书，阅读\n-7:50早饭 洗漱出门\n7. 曾** 6:25\n-7:05 早餐出门\n-7:25 遇到老同事聊天\n-7:50 国庆备考复习计划\n-8:20 学习得到课程\n8. 🐑***** 6:28\n-7:10运动\n-7:30洗头洗澡\n-7:50吃早饭\n-8:20收拾，洗漱出门\n9. 琴****** 6.30\n10. 小******* 6:36\n11. 大****** 7:00\n12. FOUND40***** 7:04\n13. e**** 7;04\n14. 猫** 7.20\n7.30 洗漱\n8.00 打球\n9.00 算法训练\n9.30 学习掘金小册\n15. 汤*** 7:26\n16. 丁**** 7.30\n-8.00 冥想\n-8.20洗漱\n-9.00 《内证****》\n17. 钱****** 7:30\n18. 康***7:40\n19. 影** 7:50\n20. 小** 7.50"
    test_msg = Message(test_msg_content)

    service = ChainMessageReminderService(test_msg)

    reminded_msg = service.get_reminded_msg()
    print(reminded_msg)
    '''
    Output:
    Hi，@琴****** @大****** @影** @小******* @汤*** @小** @钱****** @e**** @利**** @FOUND40*****，记得更新今天的早起日志哦 (*^▽^*)
    '''

    parsed_content_dict = service.get_parsed_content_dict()
    pretty_json_print_dict(parsed_content_dict)
    '''
    Output:
    {
        "大*-**": {
            "nick": "大*-**",
            "get_up_time": "04:30:00",
            "get_up_log": "-5:30阅读&筋**松\n-7:00跑***\n-8:00洗漱***路\n-9:00阅读"
        },
        "M***": {
            "nick": "M***",
            "get_up_time": "04:52:00",
            "get_up_log": "-5:10 小**\n-5:30 冥想🧘\u200d♀️\n-6:00-《也许你该找个人聊聊》\n-6:45有氧\n-7:20收拾洗漱出门"
        },
        "李***": {
            "nick": "李***",
            "get_up_time": "05:33:00",
            "get_up_log": "6:10 护肤，听课\n6:30 冥想🧘\u200d♀️，《心经》，自我肯定\n6:58 背书，蒙田的教育思想\n7:20 出门"
        },
        "和****": {
            "nick": "和****",
            "get_up_time": "06:00:00",
            "get_up_log": "-9.24\n-7.51 清理 13 个随手记正念\n-9.24 今天的依赖倒置原则终于非常快速懂了，设计原则和模式就像摄影的构图和拍人脚放在下面一样\n心智觉察解悟，原来评判也是一种情绪，评判由于有了对与错，但是实际上没有对错好坏，放下对错，对错是你五官收集起来的"
        },
        "利****": {
            "nick": "利****",
            "get_up_time": "06:10:00",
            "get_up_log": ""
        },
        "人*****": {
            "nick": "人*****",
            "get_up_time": "06:18:00",
            "get_up_log": "-6:40坐在床上清醒，最近总是睡得晚，起不来了\n-7:20听书，阅读\n-7:50早饭 洗漱出门"
        },
        "曾**": {
            "nick": "曾**",
            "get_up_time": "06:25:00",
            "get_up_log": "-7:05 早餐出门\n-7:25 遇到老同事聊天\n-7:50 国庆备考复习计划\n-8:20 学习得到课程"
        },
        "🐑*****": {
            "nick": "🐑*****",
            "get_up_time": "06:28:00",
            "get_up_log": "-7:10运动\n-7:30洗头洗澡\n-7:50吃早饭\n-8:20收拾，洗漱出门"
        },
        "琴******": {
            "nick": "琴******",
            "get_up_time": "06:30:00",
            "get_up_log": ""
        },
        "小*******": {
            "nick": "小*******",
            "get_up_time": "06:36:00",
            "get_up_log": ""
        },
        "大******": {
            "nick": "大******",
            "get_up_time": "07:00:00",
            "get_up_log": ""
        },
        "FOUND40*****": {
            "nick": "FOUND40*****",
            "get_up_time": "07:04:00",
            "get_up_log": ""
        },
        "e****": {
            "nick": "e****",
            "get_up_time": "07:04:00",
            "get_up_log": ""
        },
        "猫**": {
            "nick": "猫**",
            "get_up_time": "07:20:00",
            "get_up_log": "7.30 洗漱\n8.00 打球\n9.00 算法训练\n9.30 学习掘金小册"
        },
        "汤***": {
            "nick": "汤***",
            "get_up_time": "07:26:00",
            "get_up_log": ""
        },
        "丁****": {
            "nick": "丁****",
            "get_up_time": "07:30:00",
            "get_up_log": "-8.00 冥想\n-8.20洗漱\n-9.00 《内证****》"
        },
        "钱******": {
            "nick": "钱******",
            "get_up_time": "07:30:00",
            "get_up_log": ""
        },
        "影**": {
            "nick": "影**",
            "get_up_time": "07:50:00",
            "get_up_log": ""
        },
        "小**": {
            "nick": "小**",
            "get_up_time": "07:50:00",
            "get_up_log": ""
        }
    }
    '''
